notes/formal_preliminaries.org
#+html_head: <link rel="stylesheet" type="text/css" href="../htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../readtheorg.css"/>

#+html_head: <script src="../jquery.min.js"></script>
#+html_head: <script src="../bootstrap.min.js"></script>
#+html_head: <script type="text/javascript" src="../readtheorg.js"></script>

#+html_head: $$\def\IF#1{[\hspace{-0.8mm}[#1]\hspace{-0.8mm}]}$$
#+html_head: $$\def\divd{\ |\ }$$

#+Author: Julian Grove
#+Title: Formal preliminaries
#+bibliography: ../ur-comp-sem-2023.bib

* Overview
  We introduce here the basic concepts of /set/, /product/, /relation/, /function/, and
  then, finally, /language/.

** Sets
   A set is, intuitively speaking, a collection of objects, which we call the
   /elements/ or /members/ of the set. Any talk about sets is understood in the
   context of some universe of discourse. All sets inhabit this universe, as do
   any of the objects which we may consider to be members of a set. We may, for
   example, want to have things like words or natural numbers inhabit this
   universe. When analyzing the semantics of English, we may include other
   things too, like entities or individuals.

   For any set $A$ and any object $a$ in the universe, either one of the
   following two things is true.
   $$\begin{align*}
   a ∈ A \tag{$a$ is a member of $A$}\\
   a ∉ A \tag{$a$ is not a member of $A$}
   \end{align*}$$
   Moreover, sets are defined by their members. That means that, for every $a$
   in the universe, if $a ∈ A$ if and only if $a ∈ B$, then $A$ and $B$ are the
   same set. This is the principle of /extensionality/ for sets.
   
   We will generally help ourselves to two kinds of notation for specifying
   sets: list notation and predicate (or set-comprehension) notation. In list
   notation, we define a set by enumerating its elements between curly braces.
   For example,
   $$\{1, 2, 3\}$$
   is just the set $A$ such that $1 ∈ A$, $2 ∈ A$, $3 ∈ A$, and nothing else is
   $∈ A$. Because of extensionality, $\{1, 2, 3\}$ is the same set as $\{1, 1,
   2, 3\}$ is the same set as $\{3, 2, 2, 1\}$, etc. Using predicate notation,
   we can specify the very same set as
   $$\{x \divd x = 1 \text{ or } x = 2 \text{ or } x = 3\}$$
   In general, in writing `$\{a$ $|$ $φ\}$', $a$ will be an expression with some
   number of variables occurring in it, and $φ$ will be  sentence expressing a
   condition on the values of these variables --- any number of the variables in
   $a$, and just these, can occur in $φ$. In the example above, $a$ just was the
   variable $x$, and the condition expressed was that the value of $x$ be either
   1, 2, or 3.

   But we could also use predicate notation, as in $$\{x + 1 \divd x = 1 \text{
   or } x = 2 \text{ or } x = 3\}$$ where $a$ is the complex expression `$x +
   1$', to specify the set $\{2, 3, 4\}$.

   Importantly, there is an empty set, which we'll write `$∅$'. It has no
   members, i.e., $a ∉ ∅$ for any $a$ in the universe. It can also be written in
   list notation as `$\{\}$'.

   Given any two sets $A$ and $B$, we'll have the following set-forming
   operations.
   $$\begin{align*}
   &a ∈ A \cup B &\textit{if $a ∈ A$ or $a ∈ B$}\tag{union}\\
   &a ∈ A \cap B &\textit{if $a ∈ A$ and $a ∈ B$}\tag{intersection}\\
   &a ∈ A - B &\textit{if $a ∈ A$ and $a ∉ B$}\tag{set difference}
   \end{align*}$$
   In addition, we say one set $A$ is a /subset/ of another set $B$
   $$A ⊆ B$$
   just in case every $a ∈ A$ is also $∈ B$. If, in addition, there is some $b ∈
   B$ such that $b ∉ A$, we may write
   $$A ⊂ B$$
   ($A$ is a /proper subset/ of $B$) to indicate this. Because
   of extensionality, $A = B$ just in case both $A ⊆ B$ and $B ⊆ A$.

   We may sometimes refer to sets using notation for generalized intersection
   and union. If $S$ is a set all of whose members are also sets, we write
   $$⋃ S$$
   to mean $\{x$ $|$ $x ∈ A$ for some $A ∈ S\}$; that is, we squash $S$ into the
   union of all of its members. Likewise, we write
   $$⋂ S$$
   to mean $\{x$ $|$ $x ∈ A$ for every $A ∈ S\}$; that is, we squash $S$ into
   the intersection of all of its members. As a further convention, we may write
   $$⋂_φ A$$
   to mean
   $$⋂\text{$\{A$ $|$ $φ\}$}$$
   and, likewise,
   $$⋃_φ A$$
   to mean
   $$⋃\text{$\{A$ $|$ $φ\}$}$$
   For example, the set of odd numbers $\{1, 3, 5, ...\}$ could be expressed as
   $$⋃\{\{x + 1\} \divd x \text{ is even}\}$$
   but also as
   $$⋃_{x \text{ is even}}\{x + 1\}$$
   Similarly, the set $\{2\}$ could be expressed as
   $$⋂\{\{x + 1, 2\} \divd x \text{ is even}\}$$
   or as
   $$⋂_{x \text{ is even}}\{x + 1, 2\}$$

** Products
   Given two sets $A$ and $B$, we take their binary Cartesian product
   $$(A × B)$$
   to be the set of pairs of elements $⟨a, b⟩$, where $a ∈ A$ and $b ∈
   B$.[fn::We call $a$ the first /component/ of such a pair and $b$ the second
   component. Given a pair $p$, we will sometimes write `$π₁ p$' to refer to its
   first component and `$π₂ p$' to refer to its second component. In particular:
   $$π₁ ⟨x, y⟩ = x$$
   $$π₂ ⟨x, y⟩ = y$$
   $$⟨π₁ x, π₂ x⟩ = x$$]

   We can generalize binary products to \(n\)-ary products by considering the
   former to correspond to the special case where $n = 2$ and the general case
   $$A₁ × ... × A_{n-1} × Aₙ$$
   to be
   $$(...(A₁ × ... × A_{n-1}) × Aₙ)$$
   For example, $A × B × C$ is just $((A × B) × C)$; as such, its members are
   pairs $⟨⟨a, b⟩, c⟩$, which is just how we can encode 3-tuples $⟨a, b, c⟩$.

