notes/formal_preliminaries.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-31 Thu 23:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Formal preliminaries</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../readtheorg.css"/>
$$\def\IF#1{[\hspace{-0.8mm}[#1]\hspace{-0.8mm}]}$$
$$\def\divd{\ |\ }$$

</head>
<body>
<div id="content" class="content">
<h1 class="title">Formal preliminaries</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ecf3f1">1. Overview</a>
<ul>
<li><a href="#org2ed5b45">1.1. Sets</a></li>
<li><a href="#orgbf67d4a">1.2. Products</a></li>
<li><a href="#orgeffe647">1.3. Relations</a></li>
<li><a href="#orgb2bd610">1.4. Powerset</a></li>
<li><a href="#org1507b0d">1.5. Functions</a></li>
<li><a href="#org845072a">1.6. Languages</a></li>
</ul>
</li>
<li><a href="#org5ba3ea4">2. Examples</a>
<ul>
<li><a href="#org6ccc369">2.1. First</a></li>
<li><a href="#orgaaef207">2.2. Second</a></li>
</ul>
</li>
<li><a href="#org501aed8">3. Exercises</a>
<ul>
<li><a href="#org203401c">3.1. Part 1</a></li>
<li><a href="#orgc1650b7">3.2. Part 2</a></li>
<li><a href="#org4234709">3.3. Part 3</a></li>
<li><a href="#org4996bbd">3.4. Part 4</a></li>
<li><a href="#org8758535">3.5. Part 5</a></li>
<li><a href="#org47ef912">3.6. Part 6</a></li>
<li><a href="#orgf5f6247">3.7. Part 7</a></li>
</ul>
</li>
<li><a href="#org38e5ee5">4. Useful resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1ecf3f1" class="outline-2">
<h2 id="org1ecf3f1"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
We introduce here the basic concepts of <i>set</i>, <i>product</i>, <i>relation</i>, <i>function</i>, and
then, finally, <i>language</i>.
</p>
</div>

<div id="outline-container-org2ed5b45" class="outline-3">
<h3 id="org2ed5b45"><span class="section-number-3">1.1.</span> Sets</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A set is, intuitively speaking, a collection of objects, which we call the
<i>elements</i> or <i>members</i> of the set. Any talk about sets is understood in the
context of some universe of discourse. All sets inhabit this universe, as do
any of the objects which we may consider to be members of a set. We may, for
example, want to have things like words or natural numbers inhabit this
universe. When analyzing the semantics of English, we may include other
things too, like entities or individuals.
</p>

<p>
For any set \(A\) and any object \(a\) in the universe, either one of the
following two things is true.
\[\begin{align*}
   a ∈ A \tag{$a$ is a member of $A$}\\
   a ∉ A \tag{$a$ is not a member of $A$}
   \end{align*}\]
Moreover, sets are defined by their members. That means that, for every \(a\)
in the universe, if \(a ∈ A\) if and only if \(a ∈ B\), then \(A\) and \(B\) are the
same set. This is the principle of <i>extensionality</i> for sets.
</p>

<p>
We will generally help ourselves to two kinds of notation for specifying
sets: list notation and predicate (or set-comprehension) notation. In list
notation, we define a set by enumerating its elements between curly braces.
For example,
\[\{1, 2, 3\}\]
is just the set \(A\) such that \(1 ∈ A\), \(2 ∈ A\), \(3 ∈ A\), and nothing else is
\(∈ A\). Because of extensionality, \(\{1, 2, 3\}\) is the same set as \(\{1, 1,
   2, 3\}\) is the same set as \(\{3, 2, 2, 1\}\), etc. Using predicate notation,
we can specify the very same set as
\[\{x \divd x = 1 \text{ or } x = 2 \text{ or } x = 3\}\]
In general, in writing `\(\{a\) \(|\) \(φ\}\)', \(a\) will be an expression with some
number of variables occurring in it, and \(φ\) will be  sentence expressing a
condition on the values of these variables &#x2014; any number of the variables in
\(a\), and just these, can occur in \(φ\). In the example above, \(a\) just was the
variable \(x\), and the condition expressed was that the value of \(x\) be either
1, 2, or 3.
</p>

<p>
But we could also use predicate notation, as in \[\{x + 1 \divd x = 1 \text{
   or } x = 2 \text{ or } x = 3\}\] where \(a\) is the complex expression `\(x +
   1\)', to specify the set \(\{2, 3, 4\}\).
</p>

<p>
Importantly, there is an empty set, which we'll write `\(∅\)'. It has no
members, i.e., \(a ∉ ∅\) for any \(a\) in the universe. It can also be written in
list notation as `\(\{\}\)'.
</p>

<p>
Given any two sets \(A\) and \(B\), we'll have the following set-forming
operations.
\[\begin{align*}
   &a ∈ A \cup B &\textit{if $a ∈ A$ or $a ∈ B$}\tag{union}\\
   &a ∈ A \cap B &\textit{if $a ∈ A$ and $a ∈ B$}\tag{intersection}\\
   &a ∈ A - B &\textit{if $a ∈ A$ and $a ∉ B$}\tag{set difference}
   \end{align*}\]
In addition, we say one set \(A\) is a <i>subset</i> of another set \(B\)
\[A ⊆ B\]
just in case every \(a ∈ A\) is also \(∈ B\). If, in addition, there is some \(b ∈
   B\) such that \(b ∉ A\), we may write
\[A ⊂ B\]
(\(A\) is a <i>proper subset</i> of \(B\)) to indicate this. Because
of extensionality, \(A = B\) just in case both \(A ⊆ B\) and \(B ⊆ A\).
</p>

<p>
We may sometimes refer to sets using notation for generalized intersection
and union. If \(S\) is a set all of whose members are also sets, we write
\[⋃ S\]
to mean \(\{x\) \(|\) \(x ∈ A\) for some \(A ∈ S\}\); that is, we squash \(S\) into the
union of all of its members. Likewise, we write
\[⋂ S\]
to mean \(\{x\) \(|\) \(x ∈ A\) for every \(A ∈ S\}\); that is, we squash \(S\) into
the intersection of all of its members. As a further convention, we may write
\[⋂_φ A\]
to mean
\[⋂\text{$\{A$ $|$ $φ\}$}\]
and, likewise,
\[⋃_φ A\]
to mean
\[⋃\text{$\{A$ $|$ $φ\}$}\]
For example, the set of odd numbers \(\{1, 3, 5, ...\}\) could be expressed as
\[⋃\{\{x + 1\} \divd x \text{ is even}\}\]
but also as
\[⋃_{x \text{ is even}}\{x + 1\}\]
Similarly, the set \(\{2\}\) could be expressed as
\[⋂\{\{x + 1, 2\} \divd x \text{ is even}\}\]
or as
\[⋂_{x \text{ is even}}\{x + 1, 2\}\]
</p>
</div>
</div>

<div id="outline-container-orgbf67d4a" class="outline-3">
<h3 id="orgbf67d4a"><span class="section-number-3">1.2.</span> Products</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Given two sets \(A\) and \(B\), we take their binary Cartesian product
\[(A × B)\]
to be the set of pairs of elements \(⟨a, b⟩\), where \(a ∈ A\) and \(b ∈
   B\).<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
We can generalize binary products to \(n\)-ary products by considering the
former to correspond to the special case where \(n = 2\) and the general case
\[A₁ × ... × A_{n-1} × Aₙ\]
to be
\[(...(A₁ × ... × A_{n-1}) × Aₙ)\]
For example, \(A × B × C\) is just \(((A × B) × C)\); as such, its members are
pairs \(⟨⟨a, b⟩, c⟩\), which is just how we can encode 3-tuples \(⟨a, b, c⟩\).
</p>
</div>
</div>
