notes/formal_preliminaries.org
** Relations
   An \(n\)-ary /relation/ on the sets $A₁, ..., Aₙ$ is a set $R$ such that $R ⊆
   A₁ × ... × Aₙ$. In the special case of a binary relation on two sets $A$ and
   $B$, $R$ is a set of pairs $⟨a, b⟩$, such that $a ∈ A$ and $b ∈ B$. That is,
   $R ⊆ A × B$. For \(n\)-ary relations $R$, if the \(n\)-tuple $⟨a₁, ..., aₙ⟩$
   is a member of $R$, we can indicate this by writing
   $$R(a₁, ..., aₙ)$$
   In the special case where $n = 2$, we may also sometimes use infix notation,
   writing `$a_1 R a_2$'.

   Some properties of relations are useful to be able to describe. A relation
   $R ⊆ A × A$ (that, is a relation $R$ on $A$) is said to be /reflexive/ if $⟨x,
   x⟩ ∈ R$ for every $x ∈ A$. That is, $R$ relates everything in $A$ to
   itself. A relation $R$ on $A$ is said to be /symmetric/ if $⟨y, x⟩ ∈ R$
   whenever $⟨x, y⟩ ∈ R$. It is said to be /antisymmetric/ if the only case in
   which both $⟨x, y⟩ ∈ R$ and $⟨y, x⟩ ∈ R$ is when $x = y$. $R$ is said to be
   /transitive/ if whenever $⟨x, y⟩, ⟨y, z⟩ ∈ R$, then $⟨x, z⟩ ∈ R$. A relation
   $R$ on $A$ which is reflexive, transitive, and symmetric is said to be an
   /equivalence relation/.

   An important operation on relations is /relation composition/. Given a relation
   $R₁ ⊂ A × B$ and a relation $R₂ ⊆ B × C$, their composition $R₂ ∘ R₁ ⊆ A × C$
   is defined as
   $$R₂ ∘ R₁ = \{⟨x, y⟩ \divd \text{there is some $z$ such that } ⟨x, z⟩ ∈ R₁
   \text{ and } ⟨z, y⟩ ∈ R₂\}$$
   That is, $R₂ ∘ R₁$ is gotten by relating an element of $A$ to an element of
   $C$ just in case there is some element of $B$ related to the first element by
   $R₁$ and to the second element by $R₂$.

   If $R$ is a relation on $A$, then we will write $Rⁿ$ to refer to the result
   of composing $R$ with itself $n$ times. Thus by convention:
   $$\begin{align*}
   R⁰ &= \{⟨x, x⟩ \divd x ∈ A\}\\
   R¹ &= R\\
   Rⁿ &= R^{n - 1} ∘ R
   \end{align*}$$
   If $R ⊆ A × B$, we may define its /inverse/ as the relation $R^{-1} ⊆ B × A$
   such that $⟨y, x⟩ ∈ R^{-1}$ just in case $⟨x, y⟩ ∈ R$. That is, $R^{-1}$ is
   just like $R$, but ``flipped around''.

** Powerset
   Given a set $A$, we may take its /powerset/, $2^A$, defined as
   $$2^A = \{B \divd B ⊆ A\}$$
   That is, it is the set of subsets of $A$.
   
** Functions
   A function from a set $A$ to a set $B$ is a map from elements of $A$ to
   elements of $B$ which pairs each element of $A$ with exactly one element of
   $B$. If $f$ is such a function, we write
   $$f : A → B$$
   to indicate this, and we call $A$ the /domain/ of the function and $B$ the
   /codomain/ of the function. If $a ∈ A$, then we write
   $$f(a)$$
   to pick out the unique $b ∈ B$ that $f$ pairs $a$ with. In case $f(a) = b$,
   we call $a$ the /argument/ of the function $f$, and we call $b$ the /value/ of
   the function $f$ at $a$.

   The definition of unary functions can be generalized to that for \(n\)-ary
   functions by considering the latter to be a map from the product of $n$ sets
   $A₁, ..., Aₙ$ to a set $B$. If $f$ is such an \(n\)-ary function, we write
   $$f : A_1 × ... × A_n → B$$
   to indicate this. Given $n$ arguments $a₁ ∈ A₁, ..., aₙ ∈ Aₙ$, we write
   $$f(a_1, ..., a_n)$$
   to pick out out the $b ∈ B$ that $f$ maps $a₁, ..., aₙ$ to.

   Two properties of functions are sometimes important for certain purposes: if
   a function $f$ from $A$ (or $A₁, ..., Aₙ$) to $B$ pairs each element $a ∈ A$
   (or \(n\)-tuple $a₁ ∈ A₁, ..., aₙ ∈ Aₙ$) with a different element $b ∈ B$, we
   call $f$ an /injection/ (or a /one-to-one/ function). If for each $b ∈ B$, $f$
   pairs some or other $a ∈ A$ (or \(n\)-tuple $a₁, ..., aₙ$) with it, we call
   $f$ a /surjection/ (or an /onto/ function). If $f$ is both an injection and a
   surjection, we call it a /bijection/ from $A$ (or $A₁, ..., Aₙ$) to $B$.[fn::A
   function $f : A → B$ can be considered to be a relation on $A$ and $B$ where,
   for each $a ∈ A$, there is exactly one $b ∈ B$ such that $⟨a, b⟩ ∈ f$. More
   generally, an \(n\)-ary function can be considered an \((n+1)\)-ary relation.
   This is just a particular way of encoding functions as relations --- it isn't
   the /definition/ of a function, i.e., a map between sets, as above.]

   Note that there is a corresponding notion of /function composition/ gotten by
   considering functions as relations. Given functions $f : A → B$ and $g : B →
   C$, their composition $g ∘ f : A → C$ is such that $(g ∘ f)(x) = g(f(x))$,
   for any $x ∈ A$. In the same vein, if $f : A → A$, then we may write `$fⁿ$'
   to denote the function which ``applies $f$ to an element of $A$ $n$ times''. 

** Languages
   We write `$A^n$' to refer to the result of taking the product of the set $A$
   with itself $n$ times. As a matter of convention, we will adopt the following
   equivalences.
   $$\begin{align*}
   A^0 &=_{def} \{∅\}\\
   A^1 &=_{def} A\\
   A^n &=_{def} A^{n-1} × A
   \end{align*}$$
   To define a language, we first define a set $Σ$, which we call the /alphabet/,
   /words/, or /lexicon/ of the language. These can be anything, in principle
   (phonetic forms, features of some kind, etc.). Then, a /language/ over $Σ$ is
   some set $L$ such that
   $$L ⊆ ⋃_{i ∈ ℕ}Σⁱ$$
   where $ℕ$ is the set of natural numbers $\{0, 1, 2, ...\}$. Thus $L$ is a set
   of \(n\)-tuples of words from $Σ$ of any length $n$. When we talk about
   languages, we will refer to tuples as /strings/ and adopt the convention of
   writing, e.g., the string ⟨ /the/, /dog/, /is/, /friendly/ ⟩ simply as /the dog is
   friendly/. Note that $L$ may include $∅$, which we will regard as the empty
   string (the string of length 0).

* Examples
** First
   Prove that $A ⊆ A ∪ B$.

   By definition, this holds if everything in $A$ is also in $A ∪ B$. Recall
   that any $x ∈ A ∪ B$ if $x ∈ A$ or $x ∈ B$. Thus any $x ∈ A$ is such that $x
   ∈ A ∪ B$, as needed.

** Second
   Let $A, B ⊆ C$, and write $¬X$ for $C - X$. Prove that $¬(A ∪ B) ⊆ ¬A ∩ ¬B$.

   Assume $x ∈ ¬(A ∪ B)$; then, by definition, $x ∈ C$, but $x ∉ A ∪ B$. Hence,
   $x ∉ A$ (or else, we would have that $x ∈ A ∪ B$). But because $x ∈ C$, $x ∈
   ¬A$. A similar argument applies to $¬B$; thus $x ∈ ¬A ∩ ¬B$. As $x$ is
   arbitrary, the argument extends to any element of $¬(A ∪ B)$, as needed. 
   
* Exercises
** Part 1
   Prove that $A ∩ B ⊆ A$.

** Part 2
   Prove that $A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C)$ (intersection distributes over
   union).

** Part 3
   Prove that if $A ⊆ B$ and $B ⊆ C$, then $A ⊆ C$ (transitivity of $⊆$).

** Part 4
   Prove that if $A ⊆ B$, then $A = A ∩ B$.

