notes/formal_preliminaries.html

<div id="outline-container-orgeffe647" class="outline-3">
<h3 id="orgeffe647"><span class="section-number-3">1.3.</span> Relations</h3>
<div class="outline-text-3" id="text-1-3">
<p>
An \(n\)-ary <i>relation</i> on the sets \(A₁, ..., Aₙ\) is a set \(R\) such that \(R ⊆
   A₁ × ... × Aₙ\). In the special case of a binary relation on two sets \(A\) and
\(B\), \(R\) is a set of pairs \(⟨a, b⟩\), such that \(a ∈ A\) and \(b ∈ B\). That is,
\(R ⊆ A × B\). For \(n\)-ary relations \(R\), if the \(n\)-tuple \(⟨a₁, ..., aₙ⟩\)
is a member of \(R\), we can indicate this by writing
\[R(a₁, ..., aₙ)\]
In the special case where \(n = 2\), we may also sometimes use infix notation,
writing `\(a_1 R a_2\)'.
</p>

<p>
Some properties of relations are useful to be able to describe. A relation
\(R ⊆ A × A\) (that, is a relation \(R\) on \(A\)) is said to be <i>reflexive</i> if \(⟨x,
   x⟩ ∈ R\) for every \(x ∈ A\). That is, \(R\) relates everything in \(A\) to
itself. A relation \(R\) on \(A\) is said to be <i>symmetric</i> if \(⟨y, x⟩ ∈ R\)
whenever \(⟨x, y⟩ ∈ R\). It is said to be <i>antisymmetric</i> if the only case in
which both \(⟨x, y⟩ ∈ R\) and \(⟨y, x⟩ ∈ R\) is when \(x = y\). \(R\) is said to be
<i>transitive</i> if whenever \(⟨x, y⟩, ⟨y, z⟩ ∈ R\), then \(⟨x, z⟩ ∈ R\). A relation
\(R\) on \(A\) which is reflexive, transitive, and symmetric is said to be an
<i>equivalence relation</i>.
</p>

<p>
An important operation on relations is <i>relation composition</i>. Given a relation
\(R₁ ⊂ A × B\) and a relation \(R₂ ⊆ B × C\), their composition \(R₂ ∘ R₁ ⊆ A × C\)
is defined as
\[R₂ ∘ R₁ = \{⟨x, y⟩ \divd \text{there is some $z$ such that } ⟨x, z⟩ ∈ R₁
   \text{ and } ⟨z, y⟩ ∈ R₂\}\]
That is, \(R₂ ∘ R₁\) is gotten by relating an element of \(A\) to an element of
\(C\) just in case there is some element of \(B\) related to the first element by
\(R₁\) and to the second element by \(R₂\).
</p>

<p>
If \(R\) is a relation on \(A\), then we will write \(Rⁿ\) to refer to the result
of composing \(R\) with itself \(n\) times. Thus by convention:
\[\begin{align*}
   R⁰ &= \{⟨x, x⟩ \divd x ∈ A\}\\
   R¹ &= R\\
   Rⁿ &= R^{n - 1} ∘ R
   \end{align*}\]
If \(R ⊆ A × B\), we may define its <i>inverse</i> as the relation \(R^{-1} ⊆ B × A\)
such that \(⟨y, x⟩ ∈ R^{-1}\) just in case \(⟨x, y⟩ ∈ R\). That is, \(R^{-1}\) is
just like \(R\), but ``flipped around''.
</p>
</div>
</div>

<div id="outline-container-orgb2bd610" class="outline-3">
<h3 id="orgb2bd610"><span class="section-number-3">1.4.</span> Powerset</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Given a set \(A\), we may take its <i>powerset</i>, \(2^A\), defined as
\[2^A = \{B \divd B ⊆ A\}\]
That is, it is the set of subsets of \(A\).
</p>
</div>
</div>

<div id="outline-container-org1507b0d" class="outline-3">
<h3 id="org1507b0d"><span class="section-number-3">1.5.</span> Functions</h3>
<div class="outline-text-3" id="text-1-5">
<p>
A function from a set \(A\) to a set \(B\) is a map from elements of \(A\) to
elements of \(B\) which pairs each element of \(A\) with exactly one element of
\(B\). If \(f\) is such a function, we write
\[f : A → B\]
to indicate this, and we call \(A\) the <i>domain</i> of the function and \(B\) the
<i>codomain</i> of the function. If \(a ∈ A\), then we write
\[f(a)\]
to pick out the unique \(b ∈ B\) that \(f\) pairs \(a\) with. In case \(f(a) = b\),
we call \(a\) the <i>argument</i> of the function \(f\), and we call \(b\) the <i>value</i> of
the function \(f\) at \(a\).
</p>

<p>
The definition of unary functions can be generalized to that for \(n\)-ary
functions by considering the latter to be a map from the product of \(n\) sets
\(A₁, ..., Aₙ\) to a set \(B\). If \(f\) is such an \(n\)-ary function, we write
\[f : A_1 × ... × A_n → B\]
to indicate this. Given \(n\) arguments \(a₁ ∈ A₁, ..., aₙ ∈ Aₙ\), we write
\[f(a_1, ..., a_n)\]
to pick out out the \(b ∈ B\) that \(f\) maps \(a₁, ..., aₙ\) to.
</p>

<p>
Two properties of functions are sometimes important for certain purposes: if
a function \(f\) from \(A\) (or \(A₁, ..., Aₙ\)) to \(B\) pairs each element \(a ∈ A\)
(or \(n\)-tuple \(a₁ ∈ A₁, ..., aₙ ∈ Aₙ\)) with a different element \(b ∈ B\), we
call \(f\) an <i>injection</i> (or a <i>one-to-one</i> function). If for each \(b ∈ B\), \(f\)
pairs some or other \(a ∈ A\) (or \(n\)-tuple \(a₁, ..., aₙ\)) with it, we call
\(f\) a <i>surjection</i> (or an <i>onto</i> function). If \(f\) is both an injection and a
surjection, we call it a <i>bijection</i> from \(A\) (or \(A₁, ..., Aₙ\)) to \(B\).<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<p>
Note that there is a corresponding notion of <i>function composition</i> gotten by
considering functions as relations. Given functions \(f : A → B\) and \(g : B →
   C\), their composition \(g ∘ f : A → C\) is such that \((g ∘ f)(x) = g(f(x))\),
for any \(x ∈ A\). In the same vein, if \(f : A → A\), then we may write `\(fⁿ\)'
to denote the function which ``applies \(f\) to an element of \(A\) \(n\) times''. 
</p>
</div>
</div>

<div id="outline-container-org845072a" class="outline-3">
<h3 id="org845072a"><span class="section-number-3">1.6.</span> Languages</h3>
<div class="outline-text-3" id="text-1-6">
<p>
We write `\(A^n\)' to refer to the result of taking the product of the set \(A\)
with itself \(n\) times. As a matter of convention, we will adopt the following
equivalences.
\[\begin{align*}
   A^0 &=_{def} \{∅\}\\
   A^1 &=_{def} A\\
   A^n &=_{def} A^{n-1} × A
   \end{align*}\]
To define a language, we first define a set \(Σ\), which we call the <i>alphabet</i>,
<i>words</i>, or <i>lexicon</i> of the language. These can be anything, in principle
(phonetic forms, features of some kind, etc.). Then, a <i>language</i> over \(Σ\) is
some set \(L\) such that
\[L ⊆ ⋃_{i ∈ ℕ}Σⁱ\]
where \(ℕ\) is the set of natural numbers \(\{0, 1, 2, ...\}\). Thus \(L\) is a set
of \(n\)-tuples of words from \(Σ\) of any length \(n\). When we talk about
languages, we will refer to tuples as <i>strings</i> and adopt the convention of
writing, e.g., the string ⟨ <i>the</i>, <i>dog</i>, <i>is</i>, <i>friendly</i> ⟩ simply as <i>the dog is
friendly</i>. Note that \(L\) may include \(∅\), which we will regard as the empty
string (the string of length 0).
</p>
</div>
</div>
</div>

<div id="outline-container-org5ba3ea4" class="outline-2">
<h2 id="org5ba3ea4"><span class="section-number-2">2.</span> Examples</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6ccc369" class="outline-3">
<h3 id="org6ccc369"><span class="section-number-3">2.1.</span> First</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Prove that \(A ⊆ A ∪ B\).
</p>

<p>
By definition, this holds if everything in \(A\) is also in \(A ∪ B\). Recall
that any \(x ∈ A ∪ B\) if \(x ∈ A\) or \(x ∈ B\). Thus any \(x ∈ A\) is such that \(x
   ∈ A ∪ B\), as needed.
</p>
</div>
</div>

<div id="outline-container-orgaaef207" class="outline-3">
<h3 id="orgaaef207"><span class="section-number-3">2.2.</span> Second</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Let \(A, B ⊆ C\), and write \(¬X\) for \(C - X\). Prove that \(¬(A ∪ B) ⊆ ¬A ∩ ¬B\).
</p>

<p>
Assume \(x ∈ ¬(A ∪ B)\); then, by definition, \(x ∈ C\), but \(x ∉ A ∪ B\). Hence,
\(x ∉ A\) (or else, we would have that \(x ∈ A ∪ B\)). But because \(x ∈ C\), \(x ∈
   ¬A\). A similar argument applies to \(¬B\); thus \(x ∈ ¬A ∩ ¬B\). As \(x\) is
arbitrary, the argument extends to any element of \(¬(A ∪ B)\), as needed. 
</p>
</div>
</div>
</div>

<div id="outline-container-org501aed8" class="outline-2">
<h2 id="org501aed8"><span class="section-number-2">3.</span> Exercises</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org203401c" class="outline-3">
<h3 id="org203401c"><span class="section-number-3">3.1.</span> Part 1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Prove that \(A ∩ B ⊆ A\).
</p>
</div>
</div>

<div id="outline-container-orgc1650b7" class="outline-3">
<h3 id="orgc1650b7"><span class="section-number-3">3.2.</span> Part 2</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Prove that \(A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C)\) (intersection distributes over
union).
</p>
</div>
</div>

<div id="outline-container-org4234709" class="outline-3">
<h3 id="org4234709"><span class="section-number-3">3.3.</span> Part 3</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Prove that if \(A ⊆ B\) and \(B ⊆ C\), then \(A ⊆ C\) (transitivity of \(⊆\)).
</p>
</div>
</div>

<div id="outline-container-org4996bbd" class="outline-3">
<h3 id="org4996bbd"><span class="section-number-3">3.4.</span> Part 4</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Prove that if \(A ⊆ B\), then \(A = A ∩ B\).
</p>
</div>
</div>
